Repository: maikoldiaz/-fantastic-pancake
Catalog: Develop/Ecp.True/Ecp.True.Host.Api/Resources/SharedResource.*.resx
Languages: es

# AllowAlphanumericWithSpecialCharactersAndSpaceMessage
source: 5009-Only alphanumeric spaces and special characters like ':' '_' '-' are allowed
es: 5009-El Nombre solo admite números, letras, espacios y los siguientes caracteres especiales: ':' '_' '-'

source: Category created successfully
es: Categoría creada con éxito

source: Category element created successfully
es: Elemento creado con éxito

# CategoryElementNameAlreadyExists
source: 5006-The category element name already exists
es: 5006-El nombre del elemento ya existe

# CategoryElementNameRequired
source: 5002-Category element name is required
es: 5002-El Nombre es obligatorio

# CategoryElementNotExists
source: 5051-The category element does not exist
es: 5051-No existe el Elemento

source: Category element updated successfully
es: Elemento modificado con éxito

# CategoryGrouperIsRequired
source: 5029-The category grouper is required
es: 5029-Se requiere un agrupador de categoría

# CategoryIdRequired
source: 5031-The category id is required
es: 5031-La Categoría es obligatoria

# CategoryNameAlreadyExists
source: 5005-The category name must be unique
es: 5005-El nombre de la categoría ya existe

# CategoryNameRequired
source: 5001-Category name is required
es: 5001-El nombre es obligatorio

# CategoryNotExist
source: The category does not exist
es: No existe la Categoría

# CategoryNotExists
source: 5050-The category does not exist
es: 5050-No existe la Categoría

# CategoryStatusIsRequired
source: 5010-The category status is required
es: 5010-Se requiere el estado de la categoría

# CategoryUpdateSuccessfully
source: Category updated successfully
es: Categoría modificada con éxito

# DescriptionMaxLength1000
source: 5007-The description can contain maximum of 1000 characters
es: 5007-La descripción puede contener máximo 1000 caracteres

# DuplicateEntityInsert
source: 5026-This entity already exists
es: 5026-Esta entidad ya existe

# DuplicateNodeStorageLocationId
source: 5047-The node storage location id must be unique
es: 5047-Se encuentra el ID de ubicación de almacenamiento de nodo duplicado

# DuplicateStorageLocationProductId
source: 5048-The node storage location product id must be unique
es: 5048-Se encuentra el ID de producto de ubicación de almacenamiento duplicado

# ElementDoesNotExist
source: The category element does not exist
es: No existe el Elemento

# ElementStatusRequired
source: 5032-The category element status is required
es: 5032-Se requiere el estado del elemento

# EntityNameMustBeUnique
source: 5025-The entity name must be unique
es: 5025-La entidad con el mismo nombre ya existe

# EntityNotExists
source: 5028-The related entity does not exist
es: 5028-La entidad relacionada no existe

# EntityNotFound
source: 5027-The entity does not exist
es: 5027-La entidad que intenta actualizar no existe

# InvalidNodeId
source: 5040-The node identifier is invalid
es: 5040-Identificador de nodo no válido

# InvalidNodeStorageLocations
source: 5041-The node storage location is invalid
es: 5041-Ubicación de almacenamiento de nodo no válida

# InvalidProductLocations
source: 5042-The product is invalid
es: 5042-Ubicación del producto no válida

# Max1000Characters
source: 5013-The node description can contain maximum 1000 characters
es: 5013-La descripción del nodo puede contener máximo 1000 caracteres

# Max150Characters
source: 5011-The name can contain maximum 150 characters
es: 5011-El nombre del nodo debe tener máximo 150 caracteres

# Max20Characters
source: 5012-The logistic center can contain maximum 20 characters
es: 5012-El campo debe tener un máximo de 20 caracteres

# NameMaxLength150
source: 5004-The name can contain maximum 150 characters
es: 5004-El Nombre puede contener máximo 150 caracteres

# NODECONNECTION_CONNECTION_ALREADYEXISTS
source: 5071-A connection between the nodes already exists​
es: 5071-Ya existe una conexión entre los nodos

# NODECONNECTION_CONNECTION_NOTFOUND
source: There is no connection for the origin and destination nodes received​
es: No existe una conexión para los nodos origen y destino recibidos

# NODECONNECTION_CREATE_SUCCESS
source: Connection created successfully
es: Conexión creada con éxito

# NODECONNECTION_DELETE_CONFLICT
source: 5069-Unable to delete the connection because it has movements​ associated with it
es: 5069-No es posible eliminar la conexión debido a que tiene movimientos asociados

# NODECONNECTION_DELETE_SUCCESS
source: Connection removed successfully
es: Conexión eliminada con éxito

# NODECONNECTION_DESCRIPTION_LENGTHVALIDATION
source: 5067-The description of the node connection should not have more than 300 characters
es: 5067-La descripción de la conexión del nodo puede tener máximo 300 caracteres

# NODECONNECTION_DESTINATIONNODEID_NOTFOUND
source: 5066-Destination node identifier not found​
es: 5066-Identificador del nodo destino no encontrado

# NODECONNECTION_DESTINATIONNODEID_REQUIREDVALIDATION
source: 5065-The destination node identifier is mandatory
es: 5065-El identificador del nodo destino es obligatorio

# NODECONNECTION_SOURCENODEID_NOTFOUND
source: 5064-Source node identifier not found​
es: 5064-Identificador del nodo origen no encontrado

# NODECONNECTION_SOURCENODEID_REQUIREDVALIDATION
source: 5063-The source node identifier is mandatory
es: 5063-El identificador del nodo origen es obligatorio

# NODECONNECTION_UPDATE_SUCCESS
source: Connection updated successfully
es: Conexión actualizada con éxito

# INVALID_NODE_STATUS_FOR_CONNECTION
source: Cannot create connections to or from inactive nodes
es: No se pueden crear conexiones desde o hacia nodos inactivos

# NodeCreateSuccess
source: Node created successfully
es: Nodo creado con éxito

# NodeDoesNotExists
source: The node does not exist
es: No existe el Nodo

# NodeMustBeActive
source: 5033-The node must be active
es: 5033-El nodo debe estar activo

# NodeNameMustBeUnique
source: 5015-The node name must be unique
es: 5015-El nombre del nodo ya existe

# NodeNameRequired
source: 5016-The node name is required
es: 5016-El Nombre es obligatorio

# NodeSendToSapRequired
source: 5034-The node must have Send To SAP value
es: 5034-Se requiere envío de nodo a SAP

# NodeShouldHaveAtleastOneStore
source: 5022-A node should have atleast one storage location
es: 5022-Un nodo debe tener por lo menos un almacén

# NodeStorageLocationIdRequired
source: 5039-The node storage location id is required
es: 5039-Se requiere ID de ubicación de almacenamiento de nodo

# NodeStorageLocationMustBeActive
source: 5035-The node storage location must be active
es: 5035-La ubicación de almacenamiento del nodo debe estar activa

# NodeStorageLocationNameRequired
source: 5043-The node storage location name is required
es: 5043-El Nombre es obligatorio

# NodeStorageLocationSendToSapRequired
source: 5036-The node storage location must have Send to SAP value
es: 5036-Se requiere la ubicación de almacenamiento enviada a SAP

# NodeTypeRequired
source: 5017-The node type is required
es: 5017-El Tipo de Nodo es obligatorio

# NodeUpdateSuccess
source: Node updated successfully
es: Nodo actualizado con éxito

# NotNullConstraintsError
source: 5030-The entity does not exist
es: 5030-Esta entidad no existe

# OneOrMoreProductDoesNotBelongToPassedStorageLocation
source: 5046-One or more product does not belong to storage location
es: 5046-Uno o más productos no pertenecen a la ubicación de almacenamiento dada

# OneOrMoreProductDoesNotBelongToStorageLocation
source: 5045-One or more product does not belong to storage location
es: 5045-Uno o más productos no pertenecen a la ubicación de almacenamiento dada

# OneOrMoreStorageLocationDoesNotExists
source: 5044-One or more storage location does not exist
es: 5044-Uno o más StorageLocation no pertenecen al nodo dado

# OnlyAlphaNumericAllowed
source: 5003-Only alphanumeric characters are allowed
es: 5003-Solo se permite alfanumérico, incluido el espacio

# OperatorRequired
source: 5019-The operator is required
es: 5019-El Operador es obligatorio

# ProductIdRequired
source: 5038-The product id is required
es: 5038-Se requiere ID del producto

# ProductMustBeActive
source: 5037-The product must be active
es: 5037-El producto debe estar activo

# SapCodeRequired
source: 5020-The SAP code is required
es: 5020-El código SAP es obligatorio

# SegmentRequired
source: 5018-The segment is required
es: 5018-El Segmento es obligatorio

# StorageNameMustBeUnique
source: 5024-The storage name must be unique
es: 5024-No se permite un almacén con el mismo nombre en el nodo

# StoreShouldHaveAtLeastOneProduct
source: 5023-A storage location should have atleast one product
es: 5023-Un almacén debe tener por lo menos un producto asignado

# TypeRequired
source: 5021-The type is required
es: 5021-El Tipo es obligatorio

# HOMOLOGATION_NOTFOUND
source: 6011-There are no homologations with that ID
es: No existen homologaciones con ese identificador

# HOMOLOGATION_GROUP_NOTFOUND
source: 6010-There are no homologation groups with that ID
es: No existen grupos de homologación con ese identificador

# HOMOLOGATION_CREATE_GROUPVALIDATION
source: 5053-A homologation must have at least one homologation group
es: 5053-Una homologación debe tener por lo menos un grupo de homologación

# HOMOLOGATION_CREATE_MAPPINGVALIDATION
source: 5055-A homologation group must have at least one data mapping
es: 5055-Un grupo de homologación debe tener por lo menos un mapeo de datos

# HOMOLOGATION_CREATE_OBJECTSVALIDATION
source: 5054-A homologation group must have at least one homologation of objects
es: 5054-Un grupo de homologación debe tener por lo menos una homologación de objetos

# HOMOLOGATION_CREATE_SAMESYSTEMVALIDATION
source: 5067-The input and output system should be different
es: 5067-El sistema de entrada y el sistema de salida deben ser diferentes

# HOMOLOGATION_CREATE_SUCCESS
source: Homologation created successfully
es: Homologación creada con éxito

# HOMOLOGATION_CREATE_SYSTEMSVALIDATION
source: 5066-At least one of the input or output systems must correspond to the TRUE system
es: 5066-Por lo menos uno de los sistemas de entrada o salida debe corresponder al sistema TRUE

# HOMOLOGATION_DATASOURCEID_REQUIREDVALIDATION
source: 5059-The data source identifier in the TRUE system is mandatory
es: 5059-El identificador de la fuente de información en el sistema TRUE es obligatorio

# HOMOLOGATION_DESTINATIONSYSTEMID_REQUIREDVALIDATION
source: 5058-The destination system identifier is mandatory
es: 5058-El identificador del sistema destino es obligatorio

# HOMOLOGATION_DESTINATIONVALUE_LENGTHVALIDATION
source: 5065-The value in the destination system can contain a maximum of 100 characters
es: 5065-El valor en el sistema destino puede contener máximo 100 caracteres

# HOMOLOGATION_DESTINATIONVALUE_REQUIREDVALIDATION
source: 5066-The value in the destination system is mandatory
es: 5066-El valor en el sistema destino es obligatorio

# HOMOLOGATION_DUPLICATEDESTINATIONVALUE
source: 5072-The destination value used by the mapping should be unique for the same system
es: 5072-El valor destino en el mapeo no se debe repetir para un mismo sistema

# HOMOLOGATION_DUPLICATEGROUPTYPEID
source: 5068-Homologation groups should not be repeated
es: 5068-Los grupos de homologación no se deben repetir

# HOMOLOGATION_DUPLICATEOBJECT
source: 5069-Homologation object should not be repeated
es: 5069-El objeto de homologación no se debe repetir

# HOMOLOGATION_DUPLICATESOURCEVALUE
source: 5070-The source value used by the mapping should be unique for the same system
es: 5070-El valor origen en el mapeo no se debe repetir para un mismo sistema

# HOMOLOGATION_INVALIDSYSTEMID
source: 5071-The related system does not exist
es: 5071-La sistema relacionada no existe

# HOMOLOGATION_SAMESOURCEANDDESTINATION
source: 5065-The homologation between this systems already exists
es: 5065-La homologación entre estos sistemas ya existe

# HOMOLOGATION_SOURCEOBJECTNAME_FORMATVALIDATION
source: 5061-The object name in the source system only allows letters without spaces
es: 5061-El nombre del objeto en el sistema origen solo admite letras sin espacios

# HOMOLOGATION_SOURCEOBJECTNAME_LENGTHVALIDATION
source: 5060-The object name in the source system can contain a maximum of 30 characters
es: 5060-El nombre del objeto en el sistema origen puede contener máximo 30 caracteres

# HOMOLOGATION_SOURCEOBJECTNAME_REQUIREDVALIDATION
source: 5062-The object name in the source system is mandatory
es: 5062-El nombre del objeto en el sistema origen es obligatorio

# HOMOLOGATION_SOURCESYSTEMID_REQUIREDVALIDATION
source: 5057-The source system identifier is mandatory
es: 5057-El identificador del sistema origen es obligatorio

# HOMOLOGATION_SOURCEVALUE_LENGTHVALIDATION
source: 5063-The value in the source system can contain a maximum of 100 characters
es: 5063-El valor en el sistema origen puede contener máximo 100 caracteres

# HOMOLOGATION_SOURCEVALUE_REQUIREDVALIDATION
source: 5064-The value in the source system is mandatory
es: 5064-El valor en el sistema origen es obligatorio

# RegisterFileActionTypeRequired
source: 5075-Register file action type is required.
es: 5075-RegisterFileActionTypeRequired

# RegisterFileBlobPathMaxLength500
source: 5077-The blob path of register blob path should not have more than 500 characters
es: 5077-RegisterFileBlobPathMaxLength500

# RegisterFileBlobPathRequired
source: 5076-Register file blob path is required.
es: 5076-RegisterFileBlobPathRequired

# RegisterFileNameRequired
source: 5074-Register file name is required.
es: 5074-RegisterFileNameRequired

# RegisterFilesUploadedSuccessfully
source: 5078-Regiater files uploaded successfully.
es: 5078-RegisterFilesUploadedSuccessfully

# RegisterFileUploadFileIdRequired
source: 5073-Register file upload file id is required.
es: 5073-RegisterFileUploadFileIdRequired

# RegisterFileUploadIdMustBeUnique
source: 5072-File upload id must be unique.
es: 5072-RegisterFileUploadIdMustBeUnique

# OnlyGuidIsAllowed
source: 5079-Only guid is allowed in register file upload id.
es: 5079-OnlyGuidIsAllowed

# NODE_ASSOCIATION_SUCCESS
source: 5072-Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod.
es: 5072-Node Tagging is successful.

# OWNERID_REQUIREDVALIDATION
source: 5080-The owner identifier is mandatory
es: 5080-El identificador del propietario es obligatorio

# OWNERSHIPPERCENTAGE_REQUIREDVALIDATION
source: 5081-The ownership percentage is mandatory
es: 5081-El porcentaje de propiedad es obligatorio

# NODECONNECTION_PRODUCTID_REQUIREDVALIDATION
source: 5083-The product identifier is mandatory
es: 5083-El identificador del producto es obligatorio

# NODECONNECTIONPRODUCT_UPDATE_SUCCESS
source: 5085-Updated successfully
es: 5085-Actualización exitosa

# NODESTORAGELOCATIONPRODUCT_UPDATE_SUCCESS
source: 5086-Updated successfully
es: 5086-Actualización exitosa

# INVALID_PRIORITY
source: 5087-The priority should be a value between 1 and 10
es: 5087-La prioridad debe tener un valor entre 1 y 10

# INVENTORY_TANK_LENGTHVALIDATION
source: 5083-Tank Name should not have more than 20 characters.
es: 5083-El Tanque puede contener máximo 10 caracteres.

# SegmentDoesNotExist
source: 5092-Segment does not exist
es: 5092-Segmento no existe

# NodeTypeDoesNotExist
source: 5090-Node Type does not exist
es: 5090-Tipo de Nodo no existe

# OperatorDoesNotExist
source: 5091-Operator does not exist
es: 5091-Operador no existe

# NODECONNECTIONPRODUCTOWNERS_UPDATE_SUCCESS
source: 5093-Updated successfully
es: 5093-Actualización exitosa

# NODECONNECTION_PRODUCT_NOTEXISTS
source: 5094-Node connection doesn't have that product
es: 5094-No existe este producto para esta conexión entre nodos

# InvalidGroupType
source: The Group Type is invalid
es: El tipo de grupo no es válido

# InvalidInputType
source: Given Input type is invalid.
es: El tipo de entrada dado no es válido.

# HOMOLOGATION_GROUP_DELETE_SUCCESS
source: Homologation group successfully deleted
es: Grupo de homologación eliminado con éxito

# HOMOLOGATION_UPDATE_SUCCESS
source: Updated Successfully
es: Homologación actualizada con éxito

# RetryMessageError
source: It is not possible to retry messages related to technical exceptions. These types of exceptions must be resolved in the source system. Uncheck messages that have the option retry on the grid disabled
es: No es posible reintentar mensajes relacionados con excepciones técnicas. Este tipo de excepciones deben resolverse en el sistema origen. Desmarque los mensajes que tienen deshabilitada la opción reintentar en la grilla

# NODECOSTCENTER_STATUS_REQUIREDVALIDATION
source: 6012 - The node cost center status is required "IsActive"
es: 6012 - Se requiere el estado del nodo centro de costo "IsActive"

# NODECOSTCENTER_SOURCENODE_REQUIREDVALIDATION
source: 6013 - The node cost center source node is required "SourceNodeId"
es: 6013 - Se requiere el nodo de origen del nodo centro de costo "SourceNodeId"

# NODECOSTCENTER_MOVEMENTTYPE_REQUIREDVALIDATION
source: 6015 - The node cost center movement type is required "MovementTypeId"
es: 6014 - Se requiere el tipo de movimiento del nodo centro de costo "MovementTypeId"

# NODECOSTCENTER_COSTCENTER_REQUIREDVALIDATION
source: 6016 - The node cost center costCenter is required "CostCenterId"
es: 6015 - Se requiere el centro de costo del nodo centro de costo "CostCenterId"

# NODECOSTCENTER_CREATE_SUCCESS
source: 6016 - Nodo-Centro created successfully
es: 6016 - nodo centro de costo creado con éxito

# NODECOSTCENTER_ALREADYEXISTSINACTIVE
source: 6018 - The node cost center already exists and is inactive
es: 6017 - nodo centro de costo ya existe

# NODECOSTCENTER_ALREADYEXISTSACTIVE
source: 6017 - The node cost center already exists and is active
es: 6018 - nodo centro de costo ya existe en estado activo

# NODECOSTCENTER_NOTEXISTS
source: 6019 - The node cost center doesn't exists
es: 6019 - nodo centro de costo no existe en estado inactivo

# NODECOSTCENTER_DELETE_SUCCESS
source: 6020 - node cost center deleted successfully
es: 6020 - nodo centro eliminado con éxito

# NODECOSTCENTER_UPDATE_SUCCESS
source: 6021 - nodo cost center updated succesfully
es: 6021 - nodo centro de costo actualizado con éxito

# NODECOSTCENTER_HASMOVEMENTS
source: 6022 - node cost center has movements
es: 6022 - nodo centro de costo tiene movimientos asociados

# START_DATE_MUST_BE_LESS_THAN_END_DATE
source: 6024-Start Date must be less than End Date
es: 6024-Fecha Inicial debe ser menor a la Fecha Final
